Repository: abolfazlSadeqi/SqlGenerateStandarad
Catalog: UI/Resources/Views/Shared/_Layout.*.resx
Languages: fa

source: AlterColumn
fa: تغییر ستون

source: DropColumn
fa: حذف ستون

source: RenameColumn
fa: تغییر نام ستون

source: ManageFileGroup
fa: مدیریت فایل گروپ

# ManageProcedure
source: ManageProcedure(drop/create)
fa: مدیریت پروسیچر)ایجاد و جذف(

source: TableStorageUpdate
fa: پارتیشن و فایل گروپ جدول

# ManageView
source: ManageView(drop/create)
fa: (ایجاد و حذف )مدیریت ویو

# ManageFunction
source: ManageFunction(drop/create)
fa: (ایجاد و حذف )مدیریت فانکشن

source: DropView
fa: حذف ویو

source: DropProcedure
fa: حذف پروسیچر

# ManageSequence
source: ManageSequence(drop/create)
fa: (drop/create/Rename)مدیریت Sequence

# ManageSchema
source: ManageSchema(drop/create/Rename)
fa: (drop/create/Rename)مدیریت اسکیما

# ManageIndex
source: ManageIndex(drop/create)
fa: (drop/create)مدیریت ایندکس

source: CreateSchema
fa: ایجاد اسکیما

source: DropSchema
fa: حذف اسکیما

source: RenameSchema
fa: تغییر نام اسکیما

source: CreateFunction
fa: ایجاد تابع

source: DropFunction
fa: حذف تابع

source: CreateSequence
fa: ایجاد Sequence

source: DropSequence
fa: حذف Sequence

source: Main Menu
fa: منوی اصلی

source: Build Scripts
fa: ساخت اسکریپت‌ها

source: Extract Information
fa: دریافت اطلاعات

source: Create Table
fa: ایجاد جدول

source: Drop Table
fa: حذف جدول

source: Rename Table
fa: تغییر نام جدول

source: Column Management
fa: مدیریت ستون‌ها

source: Indexes
fa: ایندکس‌ها

source: Descriptions
fa: توضیحات آبجکت‌ها

source: Primary / Foreign Keys
fa: کلیدهای اصلی و خارجی

source: In-Memory Table
fa: جدول In-Memory

source: Filegroups Partitions
fa: فایل‌گروپ و پارتیشن‌بندی

source: Create Database
fa: ساخت دیتابیس

source: Create View
fa: ساخت ویو

source: Stored Procedure
fa: ساخت پروسیجر

source: Create Column
fa: ساخت ستون

source: Create Schema
fa: ساخت اسکیما

source: Change Schema
fa: تغییر اسکیما آبجکت‌ها

source: Default Values
fa: تغییر دیتا پیش‌فرض

source: Login User
fa: ساخت کاربر و لاگین

source: Change Login Password
fa: تغییر رمز لاگین

source: TempDB Standard
fa: استانداردسازی TempDB

source: Tables
fa: جداول

source: Views
fa: ویوها

source: Columns
fa: ستون‌ها

source: File Groups
fa: فایل‌گروپ‌ها

source: Schemas
fa: اسکیماها

source: Foreign Keys
fa: کلیدهای خارجی

source: Primary Keys
fa: کلیدهای اصلی

source: Procedures
fa: پروسیجرها

source: Database Info
fa: اطلاعات دیتابیس

source: This tool automatically generates SQL scripts following best practices and versioning standards based on user input.
fa: این ابزار به‌صورت خودکار و براساس استانداردهای نسخه‌گذاری، اسکریپت‌های SQL را بر اساس ورودی کاربر تولید می‌کند.

source: Login User
fa: ورود به سیستم

source: Delete Login
fa: حذف ورود

source: Change Login Password
fa: تغییر رمز عبور

source: Create User
fa: ایجاد کاربر

source: Delete User
fa: حذف کاربر

source: Add User to Role
fa: اضافه کردن کاربر به نقش

source: Grant Database Permission
fa: اعطای دسترسی به پایگاه داده

source: Grant Object Permission
fa: اعطای دسترسی به ابجکت

source: Add Login to Server Role
fa: اضافه کردن ورود به نقش سرور

source: Revoke Object Permission
fa: لغو دسترسی به ابجکت

source: Extract Data
fa: استخراج داده‌ها

source: Database / TempDB Management
fa: مدیریت دیتابیس و TempDB

source: Security Management
fa: مدیریت امنیت

source: Sequence / Index Management
fa: مدیریت Sequence و Index

source: Schema / Function Management
fa: مدیریت Schema و Function

source: View / Procedure Management
fa: مدیریت View و Procedure

source: Partition / FileGroup Management
fa: مدیریت Partition و FileGroup

source: Column Management
fa: مدیریت ستون‌ها

source: Table Management
fa: مدیریت جدول‌ها
